cask_args appdir: '~/Applications'

tap 'homebrew/cask-fonts'

brew 'composer'
brew 'coreutils'
brew 'curl'

brew 'git'
brew 'gnupg'

brew 'htop'
brew 'httpie'

brew 'mas'
brew 'moreutils'

brew 'nmap'
brew 'node'

brew 'openssl'

brew 'p7zip'
brew 'php'
brew 'phpunit'
brew 'php-code-sniffer'
brew 'pinentry'
brew 'pinentry-mac'

brew 'reattach-to-user-namespace'
brew 'rsync'

brew 'tmux'

brew 'vim'

brew 'watch'
brew 'wget'

brew 'youtube-dl'
brew 'yubico-piv-tool'

brew 'zsh'


cask 'adobe-photoshop-lightroom'
cask 'alfred'

cask 'bartender'
cask 'boostnote'

cask 'divvy'

cask 'firefox'
cask 'fluid'
cask 'font-firacode-nerd-font'
cask 'font-firamono-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'forklift'

cask 'gpg-suite'
cask 'google-backup-and-sync'
cask 'google-chrome'

cask 'imageoptim'
cask 'istat-menus'
cask 'iterm2'

cask 'jetbrains-toolbox'

cask 'kaleidoscope'
cask 'keepassxc'
cask 'keka'
cask 'keybase'

cask 'little-snitch'

# cask 'mamp'
cask 'microsoft-office'
cask 'microsoft-teams'
cask 'moneymoney'

# cask 'nextcloud'

# cask 'onedrive'

cask 'padbury-clock'
cask 'postbox'
cask 'postman'

cask 'qlmarkdown'

cask 'skype'
cask 'spotify'
cask 'steam'
cask 'sublime-text'

cask 'torbrowser'
cask 'tower'

cask 'vagrant'
cask 'vivaldi'
cask 'vlc'

cask 'wireshark'

cask 'zoomus'
